[
  {
    "category": "birthday1",
    "title": "75th Birthday Celebration",
    "couple": "Swarna Guruge",
    "main_date": "Saturday - 12 March 2022",
    "description_1": "A magnificent milestone celebration marking 75 years of life, love, and cherished memories. The evening was filled with heartfelt speeches, traditional ceremonies, and joyous gatherings of multiple generations.",
    "description_2": "Set against the backdrop of the prestigious Hilton Colombo, guests enjoyed an exquisite dining experience with both local and international cuisine, accompanied by live music and cultural performances that made the evening truly unforgettable.",
    "location": "Hilton Colombo",
    "date": "12 Mar 2022",
    "tags": "birthday, party"
  },
  {
    "category": "birthday2",
    "title": "Birthday Celebration",
    "couple": "Aveen",
    "main_date": "Saturday - 12 March 2022",
    "description_1": "A spectacular 21st birthday celebration at the luxurious Cinnamon Life, filled with music, dance, and endless joy.",
    "description_2": "An unforgettable evening featuring gourmet dining, stunning decorations, and cherished moments with friends and family.",
    "location": "Cinnamon Life, Colombo",
    "date": "12 Mar 2022",
    "tags": "birthday, party"
  },
  {
    "category": "church",
    "title": "Church Ceremony",
    "couple": "", 
    "main_date": "Sunday - 15 June 2022",
    "description_1": "A beautiful church wedding ceremony at the historic Dalugama Church, with traditional hymns and heartfelt vows exchanged before family and friends.",
    "description_2": "The sacred ceremony was enhanced by the church's stunning architecture and stained glass windows, creating a truly blessed atmosphere for the couple's special day.",
    "location": "Dalugama Church",
    "date": "15 Jun 2022",
    "tags": "church, wedding"
  },
  {
    "category": "indoorwedding",
    "title": "Indoor Reception",
    "couple": "", 
    "main_date": "Saturday - 10 July 2022",
    "description_1": "An elegant indoor wedding reception held at the prestigious Shangri-La Hotel, featuring exquisite decor and sophisticated ambiance.",
    "description_2": "The grand ballroom was transformed into a magical setting for dancing and celebration, with fine dining and exceptional service creating an unforgettable evening.",
    "location": "Shangri-La Hotel",
    "date": "10 Jul 2022",
    "tags": "indoor, wedding, reception"
  },
  {
    "category": "outdoorwedding1",
    "title": "Outdoor Wedding",
    "couple": "Shehara & Hansz",
    "main_date": "Friday - 3 September 2022",
    "description_1": "A beautiful evening wedding celebration by the serene Thotupola lakeside, creating a romantic atmosphere as the sun set over the water.",
    "description_2": "The outdoor venue provided a perfect backdrop for an intimate gathering of family and friends, with elegant decorations complementing the natural beauty of the location.",
    "location": "Thotupola Lake Side",
    "date": "3 Sep 2022",
    "tags": "outdoor, wedding, evening"
  },
  {
    "category": "outdoorwedding2",
    "title": "Poruwa Ceremony",
    "couple": "Ishara & Kalana",
    "main_date": "Saturday - 18 September 2022",
    "description_1": "A traditional Sri Lankan Poruwa ceremony in a stunning outdoor setting, embracing centuries-old customs and rituals. The couple exchanged vows on the beautifully decorated Poruwa platform, surrounded by fragrant flowers and the gentle sound of traditional drums.",
    "description_2": "Beautiful moments shared at the scenic Waters Edge Orchid Garden, where ancient traditions met modern elegance. The celebration featured traditional dancers, ceremonial drummers, and an auspicious lamp lighting ceremony, all set against the backdrop of blooming orchids and serene water features.",
    "location": "Waters Edge Orchid Garden",
    "date": "18 Sep 2022",
    "tags": "outdoor, wedding, poruwa"
  }
]
